<?php

namespace App\Service;

class Utils
{
    /**
     * @param string $text
     *
     * @return string
     */
    public function removeDiacritics(string $text): string
    {
        $map = [
            'á' => 'a', 'ä' => 'a', 'ą' => 'a', 'à' => 'a',
            'č' => 'c', 'ć' => 'c', 'ç' => 'c',
            'ď' => 'd',
            'é' => 'e', 'ě' => 'e', 'ę' => 'e', 'è' => 'e',
            'í' => 'i', 'ì' => 'i',
            'ľ' => 'l', 'ł' => 'l', 'ĺ' => 'l',
            'ň' => 'n', 'ń' => 'n', 'ñ' => 'n',
            'ó' => 'o', 'ö' => 'o', 'ô' => 'o', 'ő' => 'o', 'ò' => 'o',
            'ř' => 'r', 'ŕ' => 'r',
            'š' => 's', 'ś' => 's', 'ș' => 's',
            'ť' => 't', 'ţ' => 't',
            'ú' => 'u', 'ů' => 'u', 'ü' => 'u', 'ű' => 'u', 'ù' => 'u',
            'ý' => 'y',
            'ź' => 'z', 'ž' => 'z', 'ż' => 'z',
            'Á' => 'A', 'Ä' => 'A', 'Ą' => 'A', 'À' => 'A',
            'Č' => 'C', 'Ć' => 'C', 'Ç' => 'C',
            'Ď' => 'D',
            'É' => 'E', 'Ě' => 'E', 'Ę' => 'E', 'È' => 'E',
            'Í' => 'I', 'Ì' => 'I',
            'Ľ' => 'L', 'Ł' => 'L', 'Ĺ' => 'L',
            'Ň' => 'N', 'Ń' => 'N', 'Ñ' => 'N',
            'Ó' => 'O', 'Ö' => 'O', 'Ô' => 'O', 'Ő' => 'O', 'Ò' => 'O',
            'Ř' => 'R', 'Ŕ' => 'R',
            'Š' => 'S', 'Ś' => 'S', 'Ș' => 'S',
            'Ť' => 'T', 'Ţ' => 'T',
            'Ú' => 'U', 'Ů' => 'U', 'Ü' => 'U', 'Ű' => 'U', 'Ù' => 'U',
            'Ý' => 'Y',
            'Ź' => 'Z', 'Ž' => 'Z', 'Ż' => 'Z',
            'ß' => 'ss',
        ];

        return strtr($text, $map);
    }
}
